# 08_02: Summarizing distributions

In [1]:
import math
import collections
import dataclasses
import datetime

import numpy as np
import pandas as pd
import matplotlib.pyplot as pp

In [2]:
incomes = pd.read_csv('incomes.csv').set_index(['country', 'year'])
incomes

                    yearly
country year
China   1965    374.584412
        1965    332.899298
        1965     40.405060
        1965    171.425536
        1965    136.738420
...                    ...
USA     2015  17830.112511
        2015  12448.307718
        2015  87588.746752
        2015   5597.465988
        2015  36709.679066

[4000 rows x 1 columns]

In [3]:
incomes.groupby(['country','year']).count()

              yearly
country year
China   1965    1000
        2015    1000
USA     1965    1000
        2015    1000

In [4]:
incomes.loc['USA', 2015].min()

yearly    1782.58948
dtype: float64

In [5]:
incomes.loc['USA', 2015].max()

yearly    256054.350614
dtype: float64

In [6]:
incomes.loc['USA', 2015].mean()

yearly    22159.404538
dtype: float64

In [7]:
incomes.groupby(['country', 'year']).yearly.mean()

country  year
China    1965      241.117733
         2015     3651.785585
USA      1965    11529.607090
         2015    22159.404538
Name: yearly, dtype: float64

In [8]:
incomes.groupby(['country', 'year']).var()

                    yearly
country year
China   1965  2.785142e+04
        2015  7.657566e+06
USA     1965  6.507744e+07
        2015  3.836775e+08

In [9]:
incomes.groupby(['country', 'year']).std()

                    yearly
country year
China   1965    166.887455
        2015   2767.230725
USA     1965   8067.058766
        2015  19587.688162

In [10]:
pd.DataFrame({'25%': incomes.groupby(['country', 'year']).yearly.quantile(0.25),
              '50%': incomes.groupby(['country', 'year']).yearly.median(),
              '75%': incomes.groupby(['country', 'year']).yearly.quantile(0.75)})

                       25%           50%           75%
country year
China   1965    125.607498    203.478954    315.248787
        2015   1839.690284   2869.259934   4659.306189
USA     1965   6386.986126   9515.378686  14241.246328
        2015  10771.205045  16859.098812  26648.526889

In [11]:
import scipy.stats

In [12]:
incomes.groupby(['country', 'year']).yearly.apply(lambda d: scipy.stats.percentileofscore(d, 5000))

country  year
China    1965    100.0
         2015     79.8
USA      1965     13.7
         2015      4.5
Name: yearly, dtype: float64

In [13]:
incomes.groupby(['year', 'country']).yearly.describe() / incomes.loc['USA', 2015].yearly.describe()

              count      mean       std       min       25%       50%  \
year country
1965 China      1.0  0.010881  0.008520  0.008593  0.011661  0.012069
     USA        1.0  0.520303  0.411843  0.855450  0.592969  0.564406
2015 China      1.0  0.164796  0.141274  0.104280  0.170797  0.170191
     USA        1.0  1.000000  1.000000  1.000000  1.000000  1.000000

                   75%       max
year country
1965 China    0.011830  0.007736
     USA      0.534410  0.350711
2015 China    0.174843  0.076493
     USA      1.000000  1.000000